<?php

declare(strict_types=1);

return [
    /*
    |------------------------------------------------------------------------------------------------------------
    | Пакет будет использовать этот перевод при анализе файла.
    |------------------------------------------------------------------------------------------------------------
    */
    "errors" => [
        "file_not_exists"                           => "Файл: :filename не существует.",
        "file_is_empty"                             => "Файл: :filename пуст.",
        "config_mapping_parser_is_empty"            => "Конфиг: 'mapping_parser' конфиг пустой.",
        "config_mapping_parser_adapter_not_found"   => "Адаптер: не найден адаптер для расширения файла: :extension",
    ],
];
