<?php

declare(strict_types=1);

return [
    /*
    |------------------------------------------------------------------------------------------------------------
    | Пакет використовуватиме цей переклад під час роботи для аналізу файлу.
    |------------------------------------------------------------------------------------------------------------
    */
    "errors" => [
        "file_not_exists"                           => "Файл: :filename файлу не існує.",
        "file_is_empty"                             => "Файл: :filename файлу порожній.",
        "offers_is_empty"                           => "Пропозиції: пропозиції порожні.",
        "config_mapping_parser_is_empty"            => "Конфіг: 'mapping_parser' конфіг порожній.",
        "config_mapping_parser_adapter_not_found"   => "Адаптер: не знайдено адаптера для розширення файлу: :extension",
    ],
];
